tutorials/1D_advection/0_orig/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    periodic1
    {
        type            cyclic;
        neighbourPatch  periodic2;
    }

    periodic2
    {   
        type            cyclic;
        neighbourPatch  periodic1;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
