tutorials/1D_advection/system/reactions
species
(
    //O2
    //H2O
    //CH4
    //CO2
    H2
    N2
);

reactions
{
    methaneReaction
    {
        type     irreversibleArrheniusReaction;
        //reaction "CH4 + 2O2 = CO2 + 2H2O";
        reaction "N2 = N2";
        A        5.2e16;
        beta     0;
        Ta       14906;
    }
}
