tutorials/1D_advection/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
( 
    volVectorFieldValue U (50 0 0) 
    volScalarFieldValue T 367.4 
    volScalarFieldValue p 5000000 
    volScalarFieldValue N2 1 
);

regions         
( 
    boxToCell 
    {
        box (0.25 -1 -1) (0.75  1  1);
        fieldValues 
        ( 
            volScalarFieldValue T  139.4 
        ); 
    } 
);


// ************************************************************************* //
